willianchanlovegithub/DIY_projects_base_on_RT-Thread/DIY1/Second_week_mission/SEND4(stm32f103-dofly-M3S)/packages/nrf24l01-latest/src/nrf24l01.c
        l_error_count++;

        rlen = -1;
    }
    else
    {
        // shouldn't run to here
        rlen = -2;
    }

    hal_nrf24l01_port.reset_ce();

    return rlen;
}

/**
 * Please refer to nrf24_prx_cycle
 */
int nrf24_irq_prx_run(uint8_t *pb_rx, const uint8_t *pb_tx, uint8_t tlen, void (*waitirq)(void))
{
    int rlen = 0;

    (*waitirq)();
    reset_status(NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS);
    rlen = nrf24_prx_cycle(pb_rx, pb_tx, tlen);

    return rlen;
}

void nrf24_default_param(nrf24_cfg_t *pt)
{
    pt->power = RF_POWER_0dBm;
    pt->esb.ard = 5;        // (5+1)*250 = 1500us
    pt->esb.arc = 6;        // up to 6 times
    pt->crc = CRC_2_BYTE;   // crc; fcs is two bytes
    pt->adr = ADR_1Mbps;    // air data rate 1Mbps
    pt->channel = 6;        // rf channel 6

    pt->address[4] = 0xC2;  // address is 0xC2C2C2C2C4
    pt->address[3] = 0xC2;
    pt->address[2] = 0xC2;
    pt->address[1] = 0xC2;
    pt->address[0] = 0xC4;
}

/**
 * @return success returns 0; failure returns negative number
 */
int nrf24_init(nrf24_cfg_t *pt)
{
    if ((pt->role != ROLE_PTX) && (pt->role != ROLE_PRX))
    {
        rt_kprintf("[nrf24-warning]: unknown ROLE\r\n");
        _reset_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_PWR_UP);
        return -1;
    }

    hal_nrf24l01_port.init(pt->ud);

    send_activate_command(); // it doesn't work?

    enable_dpl_and_ackpayload(0);
    set_address_width5();
    set_tx_rp0_address5(pt->address);
    set_rf_power(pt->power);
    set_rf_channel(pt->channel);
    set_air_data_rate(pt->adr);
    set_crc(pt->crc);
    set_esb_param(&pt->esb);

    if (pt->use_irq) {
        //enable all irq
        enabled_irq(NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS | NRF24BITMASK_MAX_RT);
    }
    else {
        //disable all irq
        disable_irq(NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS | NRF24BITMASK_MAX_RT);
    }

    flush_rx_fifo();
    flush_tx_fifo();

    reset_status(NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS | NRF24BITMASK_MAX_RT);
    reset_observe_tx();

    if (pt->role == ROLE_PTX)
    {
        _set_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_PWR_UP);
        _reset_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_PRIM_RX);
    }
    else if (pt->role == ROLE_PRX)
    {
        _set_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_PWR_UP);
        _set_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_PRIM_RX);
        hal_nrf24l01_port.set_ce();
    }
    else
    {
        // never run to here
        ;
    }

    return 0;
}

#if defined(NRF24_USING_INFO_REPORT)

void _nrf24_report_config_reg(uint8_t data)
{
    if (data & NRF24BITMASK_PRIM_RX)
        rt_kprintf("PRX mode\r\n");
    else
        rt_kprintf("PTX mode\r\n");
    if (data & NRF24BITMASK_EN_CRC)
    {
        rt_kprintf("crc opened. FCS: ");
        if (data & NRF24BITMASK_CRCO)
            rt_kprintf("2bytes\r\n");
        else
            rt_kprintf("1byte\r\n");
    }
    else
        rt_kprintf("crc closed\r\n");
    if (!(data & (NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS | NRF24BITMASK_MAX_RT)))
    {
        if (!(data & NRF24BITMASK_RX_DR))
            rt_kprintf("RX irq; ");
        if (!(data & NRF24BITMASK_TX_DS))
            rt_kprintf("TX irq; ");
        if (!(data & NRF24BITMASK_MAX_RT))
            rt_kprintf("MAX_RT irq; ");
        rt_kprintf("opened\r\n");
    }
    else
    {
        rt_kprintf("all irq closed\r\n");
    }
    if (data & NRF24BITMASK_PWR_UP)
        rt_kprintf("power up now\r\n");
    else
        rt_kprintf("power down now\r\n");
}

void _nrf24_report_enaa_reg(uint8_t data)
{
    if (!(data & 0x3F))
    {
        rt_kprintf("all pipe AA closed");
        return;
    }

    if (data & NRF24BITMASK_PIPE_0)
        rt_kprintf("pipe0 ");
    if (data & NRF24BITMASK_PIPE_1)
        rt_kprintf("pipe1 ");
    if (data & NRF24BITMASK_PIPE_2)
        rt_kprintf("pipe2 ");
    if (data & NRF24BITMASK_PIPE_3)
        rt_kprintf("pipe3 ");
    if (data & NRF24BITMASK_PIPE_4)
        rt_kprintf("pipe4 ");
    if (data & NRF24BITMASK_PIPE_5)
        rt_kprintf("pipe5 ");
    rt_kprintf("AA opened\r\n");
}
void _nrf24_report_enrxaddr_reg(uint8_t data)
{
    if (!(data & 0x3F))
    {
        rt_kprintf("all rx-pipe closed");
        return;
    }

    if (data & NRF24BITMASK_PIPE_0)
        rt_kprintf("rx-pipe0 ");
    if (data & NRF24BITMASK_PIPE_1)
        rt_kprintf("rx-pipe1 ");
    if (data & NRF24BITMASK_PIPE_2)
        rt_kprintf("rx-pipe2 ");
    if (data & NRF24BITMASK_PIPE_3)
        rt_kprintf("rx-pipe3 ");
    if (data & NRF24BITMASK_PIPE_4)
        rt_kprintf("rx-pipe4 ");
    if (data & NRF24BITMASK_PIPE_5)
        rt_kprintf("rx-pipe5 ");
    rt_kprintf(" opened\r\n");
}
void _nrf24_report_setupaw_reg(uint8_t data)
{
    rt_kprintf("rx/tx address field width: ");
    switch (data & 0x3)
    {
    case 0:
        rt_kprintf("illegal\r\n");
        break;
    case 1:
        rt_kprintf("3bytes\r\n");
        break;
    case 2:
        rt_kprintf("4bytes\r\n");
        break;
    case 3:
        rt_kprintf("5bytes\r\n");
        break;
    }
}
void _nrf24_report_setupretr_reg(uint8_t data)
{
    rt_kprintf("auto retransmit delay: %dus\r\n", (((data & 0xF0) >> 4) + 1) * 250);
    rt_kprintf("auto retransmit count: up to %d\r\n", (data & 0x0F));
}
void _nrf24_report_rfch_reg(uint8_t data)
{
    rt_kprintf("rf channel: %d\r\n", data & 0x7F);
}
void _nrf24_report_rfsetup_reg(uint8_t data)
{
    rt_kprintf("air data rate: ");
    if (data & NRF24BITMASK_RF_DR)
        rt_kprintf("2Mbps\r\n");
    else
        rt_kprintf("1Mbsp\r\n");

    rt_kprintf("rf power: ");
    switch ((data & NRF24BITMASK_RF_PWR) >> 1)
    {
    case 0:
        rt_kprintf("-18dBm\r\n");
        break;
    case 1:
        rt_kprintf("-12dBm\r\n");
        break;
    case 2:
        rt_kprintf("-6dBm\r\n");
        break;
    case 3:
        rt_kprintf("0dBm\r\n");
        break;
    }
}
void _nrf24_report_status_reg(uint8_t data)
{
    rt_kprintf("status: ");
    if (data & NRF24BITMASK_RX_DR)
        rt_kprintf("new rx data; ");
    if (data & NRF24BITMASK_TX_DS)
        rt_kprintf("last tx ok; ");
    if (data & NRF24BITMASK_MAX_RT)
        rt_kprintf("max-rt error exist; ");

    if (data & NRF24BITMASK_TX_FULL)
        rt_kprintf("tx-fifo is full; ");
    else
        rt_kprintf("tx-fifo is not full; ");

    data = (data & NRF24BITMASK_RX_P_NO) >> 1;
    if (data > 5)
    {
        if (data == 7)
            rt_kprintf("rx-fifo empty; ");
        else
            rt_kprintf("rx-fifo not used?; ");
    }
    else
    {
        rt_kprintf("rx-fifo pipe: %d; ", data);
    }

