willianchanlovegithub/DIY_projects_base_on_RT-Thread/DIY1/Second_week_mission/SEND4(stm32f103-dofly-M3S)/packages/nrf24l01-latest/src/nrf24l01.c
    rt_kprintf("\r\n");
}
void _nrf24_report_observetx_reg(uint8_t data)
{
    rt_kprintf("lost packets count: %d\r\n", (data & NRF24BITMASK_PLOS_CNT) >> 4);
    rt_kprintf("retransmitted packets count: %d\r\n", data & NRF24BITMASK_ARC_CNT);
}

void _nrf24_report_fifostatus_reg(uint8_t data)
{
    if (data & NRF24BITMASK_TX_REUSE)
        rt_kprintf("tx-reuse opened\r\n");

    if (data & NRF24BITMASK_TX_FULL2)
        rt_kprintf("tx-fifo full\r\n");
    else if (data & NRF24BITMASK_TX_EMPTY)
        rt_kprintf("tx-fifo empty\r\n");
    else
        rt_kprintf("tx-fifo has some data\r\n");

    if (data & NRF24BITMASK_RX_RXFULL)
        rt_kprintf("rx-fifo full\r\n");
    else if (data & NRF24BITMASK_RX_EMPTY)
        rt_kprintf("rx-fifo empty\r\n");
    else
        rt_kprintf("rx-fifo has some data\r\n");
}
void _nrf24_report_dynpd_reg(uint8_t data)
{
    rt_kprintf("dynamic payload length enabled (pipe): ");
    if (!(data & 0x3F))
    {
        rt_kprintf("none\r\n");
        return;
    }

    if (data & NRF24BITMASK_PIPE_0)
        rt_kprintf("pipe0; ");
    if (data & NRF24BITMASK_PIPE_1)
        rt_kprintf("pipe1; ");
    if (data & NRF24BITMASK_PIPE_2)
        rt_kprintf("pipe2; ");
    if (data & NRF24BITMASK_PIPE_3)
        rt_kprintf("pipe3; ");
    if (data & NRF24BITMASK_PIPE_4)
        rt_kprintf("pipe4; ");
    if (data & NRF24BITMASK_PIPE_5)
        rt_kprintf("pipe5; ");
    rt_kprintf("\r\n");
}
void _nrf24_report_feature_reg(uint8_t data)
{
    rt_kprintf("feature enabled conditions: ");
    if (data & NRF24BITMASK_EN_DPL)
        rt_kprintf("dynamic payload length; ");
    if (data & NRF24BITMASK_EN_ACK_PAY)
        rt_kprintf("payload with ack; ");
    if (data & NRF24BITMASK_EN_DYN_ACK)
        rt_kprintf("W_TX_PAYLOAD_NOACK command; ");

    rt_kprintf("\r\n");
}
void nrf24_report(void)
{
    _nrf24_report_config_reg(_read_reg(NRF24REG_CONFIG));
    _nrf24_report_enaa_reg(_read_reg(NRF24REG_EN_AA));
    _nrf24_report_enrxaddr_reg(_read_reg(NRF24REG_EN_RXADDR));
    _nrf24_report_setupaw_reg(_read_reg(NRF24REG_SETUP_AW));
    _nrf24_report_setupretr_reg(_read_reg(NRF24REG_SETUP_RETR));
    _nrf24_report_rfch_reg(_read_reg(NRF24REG_RF_CH));
    _nrf24_report_rfsetup_reg(_read_reg(NRF24REG_RF_SETUP));
    _nrf24_report_status_reg(_read_reg(NRF24REG_STATUS));
    _nrf24_report_observetx_reg(_read_reg(NRF24REG_OBSERVE_TX));

    _nrf24_report_fifostatus_reg(_read_reg(NRF24REG_FIFO_STATUS));
    _nrf24_report_dynpd_reg(_read_reg(NRF24REG_DYNPD));
    _nrf24_report_feature_reg(_read_reg(NRF24REG_FEATURE));
}

#endif // NRF24_USING_INFO_REPORT

#ifdef NRF24_USING_SHELL_CMD
#include <stdlib.h>

static void nrf24(int argc, char **argv)
{
    if (argc < 2)
    {
        rt_kprintf("USAGE: nrf24 [OPTION]\r\n");
        rt_kprintf("[OPTION]:\r\n");
        rt_kprintf("          init [spiDevice]\r\n");
        rt_kprintf("          portinit [spiDevice]\r\n");
        rt_kprintf("          readreg [regAddr]\r\n");
        rt_kprintf("          writereg [regAddr] [data]\r\n");
#ifdef NRF24_USING_INFO_REPORT
        rt_kprintf("          report\r\n");
#endif // NRF24_USING_INFO_REPORT
        return;
    }    
#ifdef NRF24_USING_INFO_REPORT
    if (!rt_strcmp(argv[1], "report"))
    {
        nrf24_report();
    }
#endif // NRF24_USING_INFO_REPORT

    if (argc < 3)
    {
        return;
    }
    if (!rt_strcmp(argv[1], "readreg"))
    {
        uint8_t reg = atoi(argv[2]);
        rt_kprintf("reg:0x%x val: 0x%x\n", reg, _read_reg(reg));
    }
    if (!rt_strcmp(argv[1], "init"))
    {
        nrf24_cfg_t nrf24;
        nrf24_default_param(&nrf24);
        nrf24.role = ROLE_PRX;
        nrf24.ud = argv[2];
        nrf24_init(&nrf24);
    }
    else if (!rt_strcmp(argv[1], "portinit"))
    {
        hal_nrf24l01_port.init(argv[2]);
    }

    if (argc < 4)
    {
        return;
    }
    if (!rt_strcmp(argv[1], "writereg"))
    {
        if (!rt_strcmp(argv[1], "writereg"))
        {
            uint8_t reg = atoi(argv[2]);
            uint8_t data = atoi(argv[3]);
            _write_reg(reg, data);
        }
    }
}
MSH_CMD_EXPORT(nrf24, nrf24l01);

#endif // NRF24_USING_SHELL_CMD
